Tekla Open API Reference for Tekla Structures 2025
RebarSplice.Clearance Property
 The clearance between joined bars in the case of the lap type splice.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Clearance { get; set; }
Public Property Clearance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace